[{"category": "business", "title": "Rau's IAS, Seekers Education fined for misleading ads", "content": "The Central Consumer Protection Authority (CCPA) has imposed penalties of ₹1 lakh and ₹50,000 on Rau's IAS Study Circle and Seekers Education, respectively, for misleading advertisements. Rau's IAS was fined over claims of 'successful students' in absence of necessary disclosure with regard to the course opted by the aspirant. Seekers Education was fined for claiming a success ratio of 99.99%."}, {"category": "business", "title": "Not an endorsement: Govt on ad with Google featuring financial influencer", "content": "Google's collaborative advertisement with the government featuring financial influencer Rachana Ranade with the caption, \"Trust only the real experts,\" is being criticised online. Several Twitter users pointed out that the advertisement looked like the government was endorsing Ranade. \"This is not an endorsement of any person or any social media platform,\" Union Minister Rajeev Chandrasekhar said."}, {"category": "business", "title": "Drone maker ideaForge's ₹567 crore IPO fully subscribed in 2 hours", "content": "The initial public offering (IPO) of India's largest drone maker ideaForge Technology was fully subscribed within two hours of opening for subscription on Monday. The issue was subscribed 1.23 times as of 12.40 pm, with retail investors leading the bidding. The price band for IPO is set at ₹638-672 per share and the company is looking to raise ₹567 crore."}, {"category": "business", "title": "India to soon have ethanol-powered vehicles running at ₹15 per litre: Gadkari", "content": "Union Minister Nitin Gadkari said that India will soon have vehicles running entirely on ethanol. \"I will launch Toyota Camry that will run 100% on ethanol and it will also generate 40% electricity,\" Gadkari said. \"If you compare it with petrol, the average will be ₹15/litre because ethanol's rate is ₹60...while petrol costs ₹120/litre....plus it'd generate 40% electricity,\" he added."}, {"category": "business", "title": "Srinagar-Jammu IndiGo flight enters Pak airspace amid bad weather", "content": "A Srinagar-Jammu IndiGo flight was forced to enter Pakistani airspace on Sunday due to bad weather, the airline has said. An official from the airline said that authorities from both countries were informed before the incident and that the flight was diverted to Punjab's Amritsar. Earlier this month, another Indigo flight from Amritsar to Ahmedabad had entered the Pakistani airspace."}, {"category": "business", "title": "Tomato prices may cross ₹100/kg soon: Report", "content": "The prices of tomatoes, which are short in supply following deficient monsoon, are expected to cross the ₹100 per kg mark soon, according to several reports. Last week, the rates of tomatoes had shot up to over ₹80 per kg level. A 15-kg crate of tomatoes was sold for ₹1,100 in Kolar wholesale APMC market in Karnataka, The Hindu reported."}, {"category": "business", "title": "Pak central bank hikes key interest rate by 100 bps to record 22%", "content": "State Bank of Pakistan hiked its key interest rate by 100 basis points to a record high of 22% in an emergency meeting on Monday. The central bank said its monetary policy committee has noted that \"potential upside risks to the inflation outlook have increased from the last meeting\". This comes a day after Pakistan passed a revised FY24 Budget."}, {"category": "business", "title": "Shree Cement shares crash 10% on report of ₹23,000 crore tax evasion", "content": "Shares of Shree Cement crashed 10% on Monday after reports claimed tax evasion of ₹23,000 crore has been detected at the company in one of the biggest tax evasions in India. This comes amid Income Tax Department's searches at various company locations in Rajasthan. The company's management team is available and extending full cooperation to the officials, Shree Cement said."}, {"category": "business", "title": "Micron's ₹6,600-cr investment in Gujarat to create 20,000 jobs: FM", "content": "Finance Minister Nirmala Sitharaman said Micron Technology's investment to create a semiconductor facility in Gujarat will create 5,000 direct jobs and 15,000 indirect (community level) jobs. The US chipmaker is likely to invest $800 million (around ₹6,600 crore) towards the $2.75-billion facility, she added. Recently, PM Narendra Modi met Micron Technology's Indian-American CEO Sanjay Mehrotra."}, {"category": "business", "title": "UP CM inaugurates Reliance-backed Addverb's ₹200-cr robot factory", "content": "UP CM Yogi Adityanath on Sunday inaugurated Reliance-backed Addverb Technologies' robot manufacturing plant in Greater Noida. This is India's largest robotic manufacturing unit, authorities said, adding it has been set up with an investment of ₹200 crore. It would generate employment for more than 3,000 people, Greater Noida Industrial Development Authority stated."}, {"category": "business", "title": "IT Minister gives demo of tech that Micron is bringing to India", "content": "IT Minister Ashwini Vaishnaw on Monday gave demonstration of the semiconductor technology that US-based chipmaker Micron Technology is bringing to India. In a video, he was seen showing a wafer, which contained over 20,000 chips, to the audience. He also showed chips which are made after extracting nanometre chips from a wafer. Further, he exhibited modules where chips are inserted."}, {"category": "business", "title": "Infosys signs ₹3,700-crore deal with Denmark's Danske Bank", "content": "India's second-largest IT services firm Infosys said it has been selected by Denmark-based Danske Bank as a partner to accelerate the lender's digital transformation. The deal is valued at $454 million (over ₹3,700 crore) for five years, the company added. Infosys will also acquire the bank's IT centre in India, where more than 1,400 professionals are employed."}, {"category": "business", "title": "Kia India recalls over 30,000 units of Carens for software update", "content": "Kia India has recalled 30,297 units of its Carens model that were manufactured between September 2022 and February 2023. The company said the recalled cars will be inspected and, if required, will get a free-of-cost software update. \"The recall...has been initiated to inspect any potential error in...cluster booting process that may cause the cluster to go blank,\" the company said."}, {"category": "business", "title": "Starbucks workers hold strikes over Pride decor dispute in US", "content": "Workers at dozens of Starbucks locations held strikes in America following the accusation that managers removed rainbow flags and other decorations supporting LGBTQ+ Pride Month from several cafes. Several workers gathered near the route of Pride parade in New York and chanted, \"New York is a union town! On strike! Shut it down!\" The coffee chain denied banning Pride decorations."}, {"category": "business", "title": "Pakistan approves revised PKR 14.48 tn Budget to secure IMF deal", "content": "Pakistan's Parliament on Sunday approved a PKR 14.48 trillion Budget for FY24. The Budget was revised a day earlier to include fiscal tightening measures to secure a bailout package from International Monetary Fund (IMF). The revised Budget aims to achieve an additional PKR 215 billion in tax revenue and cut public spending by PKR 85 billion."}, {"category": "business", "title": "ICICI Bank to consider delisting ICICI Securities on Thursday", "content": "ICICI Bank will consider a proposal for delisting its retail broking arm, ICICI Securities, on Thursday. As per CNBC-TV18, the bank may consider the delisting proposal through a share swap instead of a cash payout. As of March quarter, the bank held 74.85% stake in ICICI Securities. Shares of ICICI Securities rose to a 52-week high of ₹647 on Monday."}, {"category": "business", "title": "20% tariff removal on US apples to have no impact on farmers: Govt", "content": "Removal of 20% retaliatory customs duty on imported American apples will have \"zero\" impact on Indian farmers, Commerce Department's Additional Secretary Peeyush Kumar said. MIP of ₹50 per kg and MFN duty (50%) are still applicable on imported US apples, he noted. Earlier, Congress MP Jairam Ramesh had questioned whether PM Narendra Modi cares for apple growers of Himachal Pradesh."}, {"category": "business", "title": "UAE-based Lulu Group to invest ₹10,000 crore in India over 3 years", "content": "UAE-based Lulu Group will invest ₹10,000 crore in India on ongoing projects over the next three years, Chairman Yusuff Ali MA said. The conglomerate has invested over ₹20,000 crore in India till now, he added. Further, he announced that Lulu Group has committed to invest ₹3,500 crore in Telangana over the next five years on various projects, including shopping malls."}, {"category": "business", "title": "Lulu Group to launch its 1st mall in Hyderabad by Aug: Chairman", "content": "Lulu Group Chairman Yusuff Ali MA said the UAE-based conglomerate will launch its first mall in Hyderabad by August. The mall in Hyderabad, earlier known as Manjeera Mall and re-branded as Lulu Mall, seeks to offer international shopping experience to people. The Chairman said the conglomerate will also develop a destination mall in Hyderabad with an investment of ₹2,500 crore."}, {"category": "business", "title": "RBI fines Standard Chartered India ₹30 lakh for KYC non-compliance", "content": "RBI has fined Standard Chartered India ₹30 lakh for non-compliance with certain provisions of the central bank's KYC directions. The bank allotted multiple customer identification codes to some of its individual customers, RBI said. \"This [penalty] action...isn't intended to pronounce upon the validity of any transaction or agreement entered into by the bank with its customers,\" it added."}, {"category": "business", "title": "Govt approves hike in wages of Coal India non-executive employees", "content": "The government has approved a wage revision agreement that was reached in May with trade unions for non-executive employees of Coal India Limited (CIL). The agreement provides for a 19% of minimum guaranteed benefit on emoluments and a 25% increase in allowances. It will benefit employees who were on the rolls of the company as on July 1, 2021."}, {"category": "business", "title": "More than two-thirds of ₹2,000 notes returned within 1 month: RBI", "content": "Reserve Bank of India (RBI) Governor Shaktikanta Das said that within a month of the recall order, more than two-thirds of ₹2,000 currency notes have returned to the system. On May 19, RBI had ordered the recall of ₹2,000 notes worth around ₹3.62 lakh crore. The bank has set September 30 as the last day for exchange/deposit of the notes."}, {"category": "business", "title": "Will try to lower inflation to 4%, El Nino poses a challenge: Das", "content": "RBI Governor Shaktikanta Das said the central bank will strive to bring down the inflation to 4%, which stood at 4.25% in May. \"We continue to be watchful on the inflation front. We expect inflation to be at 5.1% in FY24,\" Das stated. There are concerns around El Nino and it could pose a challenge to food inflation, he added."}, {"category": "business", "title": "Recall of ₹2,000 notes won't affect the economy negatively: RBI", "content": "Reserve Bank of India (RBI) Governor Shaktikanta Das has stated that he can say \"very clearly\" that the withdrawal of ₹2,000 notes won't have any negative impact on the economy. The extent of the positive impact will be known later, he added. The recall of ₹2,000 notes, which was announced on May 19, is part of RBI's 'Clean Note Policy'."}, {"category": "business", "title": "Airtel Business CEO Ajay Chitkara resigns", "content": "Bharti Airtel on Monday announced the resignation of Airtel Business' CEO Ajay Chitkara. \"He'll continue with the company until the third week of August,\" Airtel said in a filing. Airtel Business will now operate in three segments, with Global business led by Vani Venkatesh, Domestic business led by Ganesh Lakshminarayanan and Nxtra Data Centers led by Ashish Arora, Airtel said. "}, {"category": "sports", "title": "Sapna Gill's allegations that Prithvi Shaw molested her at pub are false: Police to court", "content": "Allegations made by social media influencer Sapna Gill, accusing cricketer Prithvi Shaw of molesting her at a Mumbai pub, are \"false and unfounded\", the police told a court on Monday. Sapna was arrested in February in connection with alleged attack on Shaw following an argument. She was later granted bail. She moved court after police didn't register case against Shaw."}, {"category": "sports", "title": "Netherlands defeat WI in Super Over after 374-run tie in ODI World Cup Qualifier 2023", "content": "Netherlands defeated West Indies by defending 30 runs in Super Over in their ODI World Cup Qualifier 2023 match. The match went into the Super Over after Netherlands scored 374/9 in response to West Indies' 374/6. With the win, Netherlands carried over two points to the Super Six stage, while West Indies will enter the stage with zero points."}, {"category": "sports", "title": "Netherlands create history, smash most runs in a Super Over in international cricket", "content": "Netherlands on Monday smashed the most runs in a Super Over in international cricket history. Netherlands all-rounder Logan van Beek smashed 30 runs off West Indies all-rounder Jason Holder in their ODI World Cup Qualifier 2023 match to set the record. West Indies managed to score eight runs in Super Over as Logan took two wickets to help Netherlands win. "}, {"category": "sports", "title": "Zimbabwe record their highest-ever total in ODI cricket history", "content": "Zimbabwe on Monday recorded their highest-ever total in ODI cricket history. Zimbabwe put up a total of 408/6 against USA in their ODI World Cup Qualifier 2023 match. Zimbabwe captain Sean Williams top-scored with 174 runs off 101 deliveries. Zimbabwe's previous highest ODI total had come on January 29, 2009, when they scored 351/7 against Kenya in Mombasa."}, {"category": "sports", "title": "Ashleigh Gardner takes 8 wickets in an innings as Australia win one-off Women's Ashes Test", "content": "Australia all-rounder Ashleigh Gardner took eight wickets in an innings as Australia defeated England by 89 runs to win the one-off Women's Ashes Test in Nottingham. Australia had set a target of 268 for England to chase. Gardner registered figures of 20-1-66-8 as England were dismissed for 178. With the win, Australia go 4-0 up in the points-based series."}, {"category": "sports", "title": "ICC shares pic of ODI World Cup trophy in space", "content": "The ICC has shared a picture of the ODI World Cup trophy in space. The ICC sent the trophy to the space for launching the  ICC Men's Cricket World Cup Trophy Tour 2023. The trophy was launched into the stratosphere, 1,20,000 feet above the Earth, through a stratospheric balloon before making a landing at the Narendra Modi Stadium in Ahmedabad. "}, {"category": "sports", "title": "I think about Titanic song when I want to achieve something: Yashasvi Jaiswal", "content": "Cricketer Yashasvi Jaiswal, who recently got his maiden call-up to Team India Test squad, in an interview, said that he thinks about Titanic's song 'My Heart Will Go On' when he wants to achieve something. \"There’s a line in the song, 'Every night in my dreams'...I just like listening to that line and that song,\" he added."}, {"category": "sports", "title": "Harsha Bhogle shares pic of 40-year-old news article he wrote on India's 1983 WC chances", "content": "Commentator Harsha Bhogle shared a picture of a 40-year-old news article he wrote on India's 1983 World Cup chances. He captioned the picture, \"A young man...not quite 22...thought India might be...dark horses in 1983.\" He added, \"Reasoning wasn't quite accurate but as it turns out the end became possible...And his father remembered to paste it in what's now...crumbling scrapbook.\""}, {"category": "sports", "title": "Chess helps me stay calm, I play with Ashwin during tours: Chahal", "content": "India bowler Yuzvendra Chahal said chess has taught him \"patience\" and helps him in playing cricket as well. \"Chess and cricket are similar, but in cricket, you can show your aggression, but in chess, you can't...especially during the flights, I play chess,\" said Chahal. The spinner added that he plays chess during tours with Ravichandran Ashwin and coach Shanker Basu."}, {"category": "sports", "title": "Virat will advise you with exact & minute details: RCB's Rawat", "content": "RCB batter Anuj Rawat said Virat Kohli always keeps the atmosphere \"positive and light\" in the dressing room. \"When you play with him, he will know exactly where you went wrong and he will advise you accordingly with minute details,\" said Rawat. The batter added that he's \"not thinking about an India call-up\" and is \"preparing for the domestic season\". "}, {"category": "sports", "title": "Ecclestone 1st woman to be on losing side post 10 wickets in Test", "content": "English spinner Sophie Ecclestone became the first woman to end up on the losing side in a Test despite recording a 10-wicket haul, following Australia's triumph in the one-off Women's Ashes Test against England. Ecclestone recorded a five-wicket haul apiece in both of Australia's innings. That wasn't enough as England were dismissed for 178 after being set a 268-run target."}, {"category": "sports", "title": "Video shows Alcaraz's best shots en route to 1st grass title win", "content": "A video posted by Tennis TV shows the best shots played by world number one Carlos Alcaraz at the Queen's Club Championships. Alcaraz won the tournament, his first grass title, to reclaim the world number one spot from Novak Djokovic heading into Wimbledon. Alcaraz defeated Australian Alex de Minaur 6-4, 6-4 to lift his fifth ATP Tour title this season. "}, {"category": "sports", "title": "Lord's not a spinning paradise, play 4 pacers in 2nd Test: Nasser", "content": "Ex-England captain Nasser Hussain has suggested England to play with four pacers in the second Ashes Test against Australia at Lord's. \"Moeen Ali, his finger, that would be a gamble,\" he said. \"Shane Warne never got a five-for [at Lord's]...I might play four seamers and Joe Root as your spinner,\" Nasser further said. The second Test will begin on Wednesday."}, {"category": "sports", "title": "Wrexham owners Ryan Reynolds, Rob McElhenney buying into Alpine F1", "content": "Actors Ryan Reynolds and Rob McElhenney are part of an investor group taking a 24 per cent stake in Alpine Racing. The $218.10 million deal values Alpine, which finished fourth in 2022's F1 constructor's championship, at around $900 million. Reynolds and McElhenney took over Welsh football club Wrexham in November 2020, funding the team's return to the English Football League. "}, {"category": "sports", "title": "Can't answer that till Nadal is playing: Federer on GOAT debate", "content": "Roger Federer said the debate over the GOAT (Greatest of All Time) in tennis will continue as long as Rafael Nadal is playing. \"You can't answer that definitively yet,\" added Federer. \"What [Novak Djokovic's] achieved is absolutely gigantic. It could be sufficient,\" stated Federer, while discussing the GOAT debate. \"Djokovic is the most successful already,\" said Federer's ex-coach Ivan Ljubicic."}, {"category": "sports", "title": "Sai Kishore smashes fastest fifty of TNPL 2023", "content": "Idream Tiruppur Tamizhans bowling all-rounder Sai Kishore, who represents GT in IPL, smashed TNPL 2023's fastest fifty in 23 balls against Ba11sy Trichy. Kishore was dismissed off the next ball after completing his half-century. His 50 comprised four fours and four sixes. Kishore smashed two fours and a six in the fifth over of his team's innings."}, {"category": "sports", "title": "Chhangte is becoming in India what Ronaldo is in world: Štimac", "content": "India men's football team head coach Igor Štimac, while talking about winger Lallianzuala Chhangte, said that Chhangte is a \"very important\" player for the \"future of Indian football\". \"Like Ronaldo in the world, that's what Chhangte is becoming in India,\" he added. Chhangte has scored 18 goals in 32 appearances across competitions in the 2022/23 season."}, {"category": "sports", "title": "Yashasvi & Rohit should open for India as they'll click: Goswami", "content": "Bengal cricketer Shreevats Goswami said the Indian team should play Yashasvi Jaiswal as an opener alongside captain Rohit Sharma. \"(Shubman) Gill should play at number 3. Yashasvi opening the batting would give India the ideal right-left combination at the top,\" said Goswami. He added that Yashasvi and Rohit would \"click well together\" as they play for Mumbai in Ranji Trophy."}, {"category": "sports", "title": "Don't understand queue: Vengsarkar post Jaffer's remark on Ruturaj", "content": "Reacting to ex-India opener Wasim Jaffer's remark on Ruturaj Gaikwad's selection for India's tour of West Indies, ex-India captain Dilip Vengsarkar said, \"I don't understand this queue. Every player's in contention.\" \"How did Ruturaj jump the queue? They could've picked Sarfaraz Khan...to honour his...performances,\" Jaffer had tweeted. Sarfaraz wasn't picked for the series against West Indies."}, {"category": "sports", "title": "Sanju Samson meets Shane Bond & Brian Lara while on US vacation", "content": "India batter Sanju Samson met with former New Zealand fast bowler Shane Bond and former West Indies captain Brian Lara in the USA. Sanju is on vacation with his wife ahead of the West Indies tour when he shared a photo with the ex-cricketers, who now coach IPL teams, on Instagram. \"Surely in some great company!!\" Sanju captioned the post."}, {"category": "sports", "title": "Navdeep Saini picks wicket on his 1st ball for Worcestershire", "content": "Indian pacer Navdeep Saini picked a wicket on the first ball he bowled for Worcestershire in the County Championship Division Two. The 30-year-old dismissed Derbyshire opener Harry Came for 1(7). Saini, who signed a four-match deal with Worcestershire, is expected to cut his county stint short after being named in India's Test squad for the upcoming series against West Indies."}, {"category": "sports", "title": "Got out for duck on debut, thought 'Will I get 2nd chance': Raina", "content": "Ex-India cricketer Suresh Raina said he was dismissed by Sri Lanka's Muttiah Muralitharan for a golden duck on his India debut in an ODI back in 2005. \"That walk to the dressing room was never ending...I kept wondering, 'Will I get another chance'?\" he added. \"MS Dhoni, Irfan Pathan and Rahul Dravid told me to not lose heart,\" he stated."}, {"category": "sports", "title": "Can they sink any further: Harsha on WI's loss vs Netherlands", "content": "Reacting to West Indies' defeat against Netherlands in Super Over in their ODI World Cup Qualifier 2023 match, commentator Harsha Bhogle tweeted, \"Rubbing my eyes in disbelief.\" \"Can the West Indies sink any further or do they need to hit rock bottom to start getting back? It's a very difficult night to be a lover of Caribbean cricket,\" added Harsha."}, {"category": "sports", "title": "LaLiga shares video of top 10 freekick goals scored last season", "content": "LaLiga shared a video of the Top 10 goals scored via freekicks during the 2022-2023 season. The video features goals scored by Real Madrid forwards Karim Benzema and Rodrygo, while also showing Alex Baena's goal for Villarreal CF against Athletic Club. The top spot has been taken up by UD Almeria forward Adrian Embarba's strike against Girona FC."}, {"category": "sports", "title": "We weren't in awe of West Indies as shown in '83': Roger Binny", "content": "BCCI President Roger Binny said a scene in the movie '83' showing the Indian team being in awe of West Indies' players was not true. \"The scene shows that...we look at them (West Indies players) in awe...in reality, such a thing did not happen,\" said Binny. The movie is a biographical sports drama based on India's 1983 World Cup win."}, {"category": "technology", "title": "Haven't started training, if it happens, I will: Musk on cage fight with Zuckerberg", "content": "Referring to his cage fight with Facebook CEO Mark Zuckerberg, the world's richest person Elon Musk said, \"I haven't started training yet. So if this does happen, I will.\" While attending a birthday party, Musk also said that the match \"might actually happen\" and that it was possible that it could go badly if Zuckerberg takes the match seriously."}, {"category": "technology", "title": "Combination of tech, talent will guarantee bright future: PM Modi", "content": "The combination of technology and talent will be a guarantee for a bright future for the world, PM Narendra Modi said at India-US Hi-Tech Handshake. \"This morning (meeting) is only among a few friends but has brought with it the guarantee of a bright future,\" he said. US President and CEOs of top Indian and American companies attended the event.\n\n"}, {"category": "technology", "title": "This is the moment to invest in India: PM Modi to US investors", "content": "PM Narendra Modi said to US investors \"this is the moment\" to invest in India as governments of both US and India have laid the groundwork for businesses and companies to take advantage of the opportunity and to \"play and prosper\". He highlighted the opportunities India offers and reiterated how this is the moment to invest in India's growth story."}, {"category": "technology", "title": "Video shows Mark Zuckerberg training in jiu-jitsu amid Musk's cage fight challenge", "content": "Podcaster Lex Fridman took to Twitter to share a video of him training in jiu-jitsu with Meta's billionaire CEO Mark Zuckerberg amid Elon Musk's cage fight challenge. \"It's inspiring to see both Elon and Mark taking on the martial arts journey,\" he wrote. Brazilian jiu-jitsu is a form of Japanese martial art which involves grappling, ground fighting, and submission holds."}, {"category": "technology", "title": "Not an endorsement: Govt on ad with Google featuring financial influencer", "content": "Google's collaborative advertisement with the government featuring financial influencer Rachana Ranade with the caption, \"Trust only the real experts,\" is being criticised online. Several Twitter users pointed out that the advertisement looked like the government was endorsing Ranade. \"This is not an endorsement of any person or any social media platform,\" Union Minister Rajeev Chandrasekhar said."}, {"category": "technology", "title": "IITs, NITs, Indian Army targeted by Pakistan-based hackers: Report", "content": "A Pakistan-based hacking group named Transparent Tribe has been targeting Indian Army and the country's education sector, Quick Heal Technologies' enterprise arm Seqrite reported. As per the report, attacks against educational institutions including IITs and NITs reached their peak in February. The army is reportedly being targeted via a malicious file called 'Revision of Officers posting policy'."}, {"category": "technology", "title": "Marvel uses AI for 'Secret...' opening credits, faces backlash", "content": "Marvel has been criticised for using AI to create opening credits for its latest series 'Secret Invasion'. In an interview with Polygon, Director Ali Selim said VFX company Method Studios used AI to produce the intro sequence. \"I believe AI to be unethical...and designed solely to eliminate artists' careers,\" Jeff Simpson, who worked on the series, tweeted."}, {"category": "technology", "title": "Nothing has been artificially made: Paul on Beatles song using AI", "content": "Singer-songwriter Paul McCartney said nothing has been \"artificially or synthetically created\" in The Beatles' upcoming song. His clarification came after he recently said AI was used to extract late singer John Lennon's voice from an old demo for the new song. \"It's all real...We cleaned up some existing recordings, a process which has gone on for years,\" McCartney said."}, {"category": "technology", "title": "Micron's ₹6,600-cr investment in Gujarat to create 20,000 jobs: FM", "content": "Finance Minister Nirmala Sitharaman said Micron Technology's investment to create a semiconductor facility in Gujarat will create 5,000 direct jobs and 15,000 indirect (community level) jobs. The US chipmaker is likely to invest $800 million (around ₹6,600 crore) towards the $2.75-billion facility, she added. Recently, PM Narendra Modi met Micron Technology's Indian-American CEO Sanjay Mehrotra."}, {"category": "technology", "title": "Google Search launches 'Perspectives' filter for human experiences", "content": "Google has rolled out its 'Perspectives' filter for Search that will show results based on human experiences. The filter will display videos, images and written posts that people have shared on discussion boards, Q&A sites and social media platforms regarding a particular topic, Google said in May. There will also be a dedicated 'Perspectives' section, the company stated."}, {"category": "technology", "title": "Apple headset can make any surface touchscreen display: Report", "content": "Apple's mixed-reality headset Vision Pro is capable of transforming any surface into a touchscreen display, AppleInsider reported citing a developer. As per the report, the feature allows users to pick a surface within the headset's field of view and project controls and applications onto it. Apple Vision Pro will be available in the US next year."}, {"category": "technology", "title": "IT Minister gives demo of tech that Micron is bringing to India", "content": "IT Minister Ashwini Vaishnaw on Monday gave demonstration of the semiconductor technology that US-based chipmaker Micron Technology is bringing to India. In a video, he was seen showing a wafer, which contained over 20,000 chips, to the audience. He also showed chips which are made after extracting nanometre chips from a wafer. Further, he exhibited modules where chips are inserted."}, {"category": "technology", "title": "Alphabet to deploy laser internet tech in India at large scale ", "content": "Google parent Alphabet is moving towards the large-scale deployment of laser internet technology in India under its Taara project, Taara and its partner Bharti Airtel told Reuters. Mahesh Krishnaswamy, who leads Taara, said the technology would help people across thousands of Indian villages to come online. Taara has also partnered with internet provider Bluetown in the country."}, {"category": "technology", "title": "Robot dog with attached flamethrower created by US company", "content": "A US company called Throwflame will start selling a robot dog with an attached flamethrower later this year, as per its website. The robot named 'Thermonator' will be capable of throwing flames at a range of up to 30 feet. According to Gizmodo, the company has apparently created Thermonator by attaching its ARC Flamethrower to the Unitree Go1 quadruped robot."}, {"category": "technology", "title": "Telegram down in Russia after Wagner group rebellion: Report", "content": "A report citing DownRadar claimed messaging app Telegram was down in some Russian cities, including Moscow and St Petersburg. On Saturday night (IST), Telegram Messenger tweeted about connection issues experienced by some users in Europe. This comes after Russian paramilitary group Wagner rebelled against the Russian military. Telegram is a major source of information in Russia."}, {"category": "technology", "title": "Japan's military plans to use Musk's Starlink service: Report", "content": "Japan's military plans to use Elon Musk's Starlink internet satellite service from next fiscal year, local newspaper Yomiuri reported. It has been reportedly testing the service since March at about 10 locations. While authorities already have access to communication satellites in geostationary orbit, Starlink will give them access to low-Earth orbit, the report noted."}, {"category": "technology", "title": "NASA creates all-electric aircraft to support USA's net-zero goal", "content": "NASA has created an all-electric aircraft as part of its commitment to support the US climate goal of achieving net-zero greenhouse gas emissions from the aviation sector by 2050. The X-57 Maxwell project will be finished later this year. \"[The team] did things that had never been done before, and that's never easy,\" NASA official Bradley Flick said."}, {"category": "technology", "title": "UP CM inaugurates Reliance-backed Addverb's ₹200-cr robot factory", "content": "UP CM Yogi Adityanath on Sunday inaugurated Reliance-backed Addverb Technologies' robot manufacturing plant in Greater Noida. This is India's largest robotic manufacturing unit, authorities said, adding it has been set up with an investment of ₹200 crore. It would generate employment for more than 3,000 people, Greater Noida Industrial Development Authority stated."}, {"category": "technology", "title": "India has seen unprecedented digital revolution in recent yrs: PM", "content": "PM Narendra Modi said India has seen an unprecedented digital revolution in recent years. \"This changed India will surprise you,\" he added. \"In India today, any person from anywhere can access banking services 24x7. Doesn't matter if it's Sunday or Monday, banking services don't get affected. I can give countless examples of such changes India is seeing,\" he further said."}, {"category": "technology", "title": "PM Modi's US visit to bolster strategic collaboration: India Inc", "content": "PM Narendra Modi's US visit will boost bilateral ties, India Inc said. CII Director General Chandrajit Banerjee said, \"A new chapter has been added to the partnership that will see a much stronger collaboration in strategic technology collaboration, including defence, semiconductor...space and in emerging technology sectors like AI and quantum, advanced materials and telecommunications.\""}, {"category": "technology", "title": "Hermès wins permanent ban on 'MetaBirkin' NFT sales in US lawsuit", "content": "Luxury brand Hermès won a lawsuit to permanently block artist Mason Rothschild's sales of 'MetaBirkin' non-fungible tokens (NFTs) after a US jury's verdict that they violated Hermès' trademark rights in its famed Birkin handbags. The judge said the permanent injunction was justified because Rothschild's continued NFT marketing would likely confuse consumers and irreparably harm the company."}, {"category": "technology", "title": "KTR posts video of progress of Foxconn plant project in Telangana", "content": "Telangana Industries and Commerce Minister KT Rama Rao (KTR) posted a video of the progress of Foxconn plant in Ranga Reddy. \"Just over a month ago, we had broken ground for the Foxconn plant,\" KTR tweeted, adding, \"'Telangana speed' that...Foxconn Chairman...Young Liu alluded to is being adopted well by his team.\" Earlier, Liu had called Telangana's speed of working \"fast\"."}, {"category": "technology", "title": "Infosys signs ₹3,700-crore deal with Denmark's Danske Bank", "content": "India's second-largest IT services firm Infosys said it has been selected by Denmark-based Danske Bank as a partner to accelerate the lender's digital transformation. The deal is valued at $454 million (over ₹3,700 crore) for five years, the company added. Infosys will also acquire the bank's IT centre in India, where more than 1,400 professionals are employed."}, {"category": "technology", "title": "Pune IT engineer loses ₹49 lakh in 'liking YouTube videos' scam", "content": "A Pune-based IT engineer allegedly lost ₹49 lakh after she was offered a job to earn money by liking YouTube videos. The victim initially received ₹150 and ₹350 for completing the tasks but was later asked to invest money to get a 30% return, police said. She invested ₹49 lakh but failed to get any returns, police added."}, {"category": "technology", "title": "World Bank approves $255 mn loan for Indian govt-run institutions", "content": "The World Bank has approved a $255.5 million loan for improving the quality of technical education in around 275 government-run institutions across India. As part of the project, students will get access to upgraded curricula including emerging technologies in communication and climate resilience. They will also benefit from better internship and placement services, the World Bank said."}, {"category": "entertainment", "title": "We will definitely kill Salman Khan, he disrespected Bishnoi community: Goldy Brar", "content": "Fugitive gangster Goldy Brar, in an interview with India Today, stated that they will \"definitely kill\" Salman Khan as he disrespected Bishnoi community by killing black buck. \"Lawrence Bishnoi had asked him to apologise, but he didn't,\" he said. \"We will continue our attempts against all our enemies,\" he further said. "}, {"category": "entertainment", "title": "Actor Bose Venkat's sister dies of heart attack, his brother passes away during her funeral", "content": "Actor Bose Venkat, who is known for working in Tamil films, lost his sister and brother within hours on Friday. His sister, who resided in Chennai, passed away due to a heart attack on Friday morning, while his brother, who lived in Pudukkottai district, collapsed and passed away during her funeral. His brother also suffered a heart attack, reports said."}, {"category": "entertainment", "title": "Moosewala had more than necessary money, he misused political and police power: Goldy Brar", "content": "Fugitive gangster Goldy Brar, in an interview with India Today, stated that they killed singer Sidhu Moosewala as he had more than necessary money, adding that he misused political and police power. Brar further said, \"He was an egoistic person...He had personally harmed us, made some mistakes that were unforgivable, so we had to punish him.\""}, {"category": "entertainment", "title": "'Pasoori' song remixed for 'SatyaPrem Ki Katha'; people react", "content": "The 'Pasoori' song sung by Pakistani singers Ali Sethi and Shae Gill has been remixed and released as 'Pasoori Nu' sung by Arijit Singh and Tulsi Kumar for Kartik Aaryan and Kiara Advani-starrer 'SatyaPrem Ki Katha'. People reacted to the remix with tweets like, \"Just one word - WHY\" and \"Copywood\". Another tweeted, \"Now this song belongs to India too.\""}, {"category": "entertainment", "title": "YouTuber Devraj Patel was hit by a truck during fatal road accident", "content": "YouTuber Devraj Patel was hit by a truck, leading to his death in Chhattisgarh, a police official said. Patel suffered severe injuries to the head and other body parts, the official said, adding that his friend, who was on the bike with him, was injured. Patel was best known for his 'Dil se bura lagta hai bhai please bhai' meme."}, {"category": "entertainment", "title": "YouTuber Devraj, known for 'Dil se bura lagta hai bhai' meme, passes away in road accident", "content": "YouTuber Devraj Patel, known for 'Dil se bura lagta hai bhai please bhai' meme, passed away in a road accident in Chhattisgarh's Raipur. Condoling his demise, Chhattisgarh CM Bhupesh Baghel tweeted, \"The loss of incredible talent at such a young age is extremely tragic. May god give strength to his family and loved ones to bear this loss. Om Shanti.\""}, {"category": "entertainment", "title": "Sapna Gill's allegations that Prithvi Shaw molested her at pub are false: Police to court", "content": "Allegations made by social media influencer Sapna Gill, accusing cricketer Prithvi Shaw of molesting her at a Mumbai pub, are \"false and unfounded\", the police told a court on Monday. Sapna was arrested in February in connection with alleged attack on Shaw following an argument. She was later granted bail. She moved court after police didn't register case against Shaw."}, {"category": "entertainment", "title": "Kusha Kapila, husband Zorawar part ways after 6 years of marriage", "content": "Digital content creator Kusha Kapila revealed  that she and her husband Zorawar Singh Ahluwalia have mutually decided to part ways after six years of marriage. \"This hasn't been an easy decision...but we know it's the right one at this point in our lives,\" she wrote. \"We will continue to co-parent the love of our lives, Maya,\" she added."}, {"category": "entertainment", "title": "A fan wrote my name with compass, it was creepy: Parth Samthaan", "content": "Actor Parth Samthaan shared the \"weirdest\" thing a fan did for him. \"A fan had written my name on her [shoulder] with a compass. That was the most creepiest...[thing] I'd say,\" he recalled.  He shared that he chose not to meet this fan because that would mean encouraging others to do the same. He also spoke about his \"obsessed\" ex-girlfriend. "}, {"category": "entertainment", "title": "Video shows Kiara, Kartik promoting 'Satyaprem...' amid heavy rain", "content": "A video of Kiara Advani and Kartik Aaryan surfaced on Internet in which the actress and the actor were seen attending promotional event for 'Satyaprem Ki Katha' amid heavy rainfall. 'Satyaprem Ki Katha' marks Kiara and Kartik's second film together after 'Bhool Bhulaiyaa 2'. Earlier, Kiara had said that the two have grown as actors in the last one year. "}, {"category": "entertainment", "title": "I was like, 'What is she': Amruta Subhash on her 'Lust...' role", "content": "Actress Amruta Subhash said that she did not understand her 'Lust Stories 2' character. \"I didn't understand what she was going through...I [was] like 'What is she, how can she be the way she is? Tell me who she is'. As an actor, to know this mind was a bit shocking,\" Amruta added. "}, {"category": "entertainment", "title": "People said many things about me, labelled me with names: Rhea", "content": "Actress Rhea Chakraborty, recalling her difficult times, shared that people had a lot to say about her. \"I have been labelled with many names...But will I accept those labels? Will I stop living because of them? Not at all,\" she said. Rhea, who was dating late actor Sushant Singh Rajput, was accused of abetment of suicide by the actor's family. "}, {"category": "entertainment", "title": "Shah Rukh to star in daughter Suhana's theatrical debut: Report   ", "content": "Shah Rukh Khan is teaming up with his daughter, Suhana Khan, for a film which will mark the latter's theatrical debut, according to a report. The upcoming project will be produced by Shah Rukh's Red Chillies Entertainment and Siddharth Anand's Marflix Pictures. Suhana will make her acting debut with 'The Archies', a musical-drama which will release on an OTT platform.   "}, {"category": "entertainment", "title": "Kuljit Pal stood by me after I faced four flops, made Arth: Bhatt", "content": "Filmmaker Mahesh Bhatt remembered producer Kuljit Pal and called him \"a brave man\" for supporting 'Arth'. \"It takes guts...to stand by a director who has faced four flops and has been written off by the industry. Kuljit stuck by me through thick and thin,\" he told ETimes. Mahesh said without Kuljit, he wouldn't have had an \"enduring career\". \n"}, {"category": "entertainment", "title": "First look of Hrithik Roshan's 'Fighter' released    ", "content": "Hrithik Roshan on Monday shared the first look of his upcoming aerial action film 'Fighter' on his Instagram handle. He captioned the still with the hashtag \"7 months to Fighter\". Directed by Siddharth Anand, the film will arrive in theatres on January 25, 2024. In addition to Hrithik, it will feature Deepika Padukone and Anil Kapoor.    "}, {"category": "entertainment", "title": "Two girls fought over me in a bar, wasn't a beautiful sight: Parth", "content": "Actor Parth Samthaan in an interview revealed that once two girls fought over him at a bar. \"They were pulling each other's hair, and that wasn't a beautiful scene or a sight to watch,\" he added. \"I was sitting in...corner because I was told not to interfere as it was a female matter...but they were fighting for me,\" said Parth.\n"}, {"category": "entertainment", "title": "SRK is inspiration, Salman treats everyone well: Rajpal Yadav", "content": "Actor Rajpal Yadav opened up about working with Salman Khan and Shah Rukh Khan. \"Salman...treats everyone - from spot boys to co-actors - really well. He's good to everyone,\" he recalled. The actor also shared his experience of working with Shah Rukh Khan and recalled how he has \"inspired\" Rajpal \"a lot\" in his life. "}, {"category": "entertainment", "title": "We're not connected: Surekhavani on KP Chowdary's drug case arrest", "content": "Tollywood actress Surekhavani shared a video on her social media in which she requested people to not connect her or her family to the ongoing drug scandal. Her number was found on the contact list of producer KP Chowdary, who was arrested recently. \"Because of such allegations, my career, future, my children's careers...are [getting] affected,\" she added."}, {"category": "entertainment", "title": "I composed tune of 'Chaiyya..', presented it to Rahman: Sukhwinder", "content": "Singer Sukhwinder Singh said he \"composed\" the tune of 'Chaiyya Chaiyya' and presented the tune to music composer AR Rahman. \"That composition stuck with him and had so much effect on him that on that tune itself Gulzar...penned the lyrics...It turned out to be really good,\" he shared. The song featured Shah Rukh Khan and Malaika Arora.  "}, {"category": "entertainment", "title": "My friend once walked in when 2 were in act of copulation: Konkona", "content": "Actress-filmmaker Konkona Sensharma said a friend shared her account of walking in when two others were engaged in an act of copulation, which inspired her segment of 'Lust Stories 2'. \"Lust, in my mind, is associated with something forbidden...the idea was to bring forward something lustful that ideally has a deeper resonance,\" she added. The anthology releases on June 29."}, {"category": "entertainment", "title": "'The Kerala Story' makers announce next film 'Bastar'    ", "content": "Director Sudipto Sen and producer Vipul Shah, the duo behind 'The Kerala Story', have teamed up for another project titled 'Bastar'. According to the makers, the forthcoming film is based on a \"true incident\" and will be released next year on April 5. 'The Kerala Story', which was released on May 5, collected more than ₹200 crore in India.   \n "}, {"category": "entertainment", "title": "Story needed them: Amit on pairing Kajol with Kumud in 'Lust...' ", "content": "Filmmaker Amit Sharma opened up about casting Kajol opposite Kumud Mishra in his segment of the anthology film 'Lust Stories 2' and said that he is fortunate that they agreed to do it as \"the story needed them\". \"It was a very difficult cast to think of but I thought of these two and they said yes,\" he added.    "}, {"category": "entertainment", "title": "1,000 dancers had to reshoot as Bhansali saw 1 unlit lamp: Sharad ", "content": "Sharad Kelkar shared an incident from the sets of 'Ram-Leela' and revealed a dance sequence involving 1,000 people had to be reshot as Sanjay Leela Bhansali noticed one unlit lamp in the background. \"A normal filmmaker wouldn't give a damn about it saying there are 50 other lamps...but...he (Bhansali) said, 'The dia isn't lit there, go light it',\" Sharad added. \n  "}, {"category": "entertainment", "title": "Many are comfortable with it: Sharman Joshi on casting couch", "content": "Sharman Joshi said that while he doesn't have doubts about the possibilities of casting couch, \"there are many youngsters...who are comfortable with it\". The actor added it's \"tough\" to stand against someone who's powerful and rich. \"They're aware of...that if they do get in trouble, they have...highest ones to help them swing out of it,\" Sharman shared in an interview."}, {"category": "entertainment", "title": "Mother once saw me getting slapped in show, got scared: Rajpal   ", "content": "Actor Rajpal Yadav in an interview recalled how his mother got scared after seeing him getting beaten up in the 1999 Doordarshan television show, 'Mungeri Ke Bhai Naurangilal'. \"My mother was terrified...and she walked off. Later, I had to explain to her that it was just acting and these are all trained actors,\" Rajpal added. \n   "}]